load-tests/artillery-config.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up to 50 users/sec"
    
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load (50 users/sec)"
    
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load (100 users/sec)"
    
    # Cool-down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"
  
  # Payload configuration
  payload:
    path: "./test-data.csv"
    fields:
      - email
      - password
    order: sequence
    skipHeader: true
  
  # HTTP configuration
  http:
    timeout: 30
    pool: 50
  
  # Plugins
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  
  # Environment variables
  variables:
    apiUrl: "http://localhost:3000"
  
  # Default headers
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

scenarios:
  # Authentication flow
  - name: "Authentication Flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/auth/logout"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
  
  # Vehicle inspection flow
  - name: "Vehicle Inspection Flow"
    weight: 30
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "driver@example.com"
            password: "{{ $processEnvironment.ARTILLERY_TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Get vehicles
      - get:
          url: "/api/vehicles"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$[0].id"
              as: "vehicleId"
      
      # Create inspection
      - post:
          url: "/api/inspections"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            vehicleId: "{{ vehicleId }}"
            driverId: 1
            companyId: 1
            type: "PRE_TRIP"
            odometerReading: 50000
            fuelLevel: 75
            tyresCondition: "PASS"
            lightsCondition: "PASS"
            brakesCondition: "PASS"
            fluidLevelsCondition: "PASS"
            bodyCondition: "PASS"
            interiorCondition: "PASS"
            overallStatus: "PASS"
          expect:
            - statusCode: 201
  
  # Defect management flow
  - name: "Defect Management Flow"
    weight: 20
    flow:
      # Login as mechanic
      - post:
          url: "/api/auth/login"
          json:
            email: "mechanic@example.com"
            password: "{{ $processEnvironment.ARTILLERY_TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Get defects
      - get:
          url: "/api/defects?status=OPEN"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$[0].id"
              as: "defectId"
      
      # Update defect status
      - patch:
          url: "/api/defects/{{ defectId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            status: "IN_PROGRESS"
          expect:
            - statusCode: 200
  
  # GPS tracking flow
  - name: "GPS Tracking Flow"
    weight: 15
    flow:
      # Login as driver
      - post:
          url: "/api/auth/login"
          json:
            email: "driver@example.com"
            password: "{{ $processEnvironment.ARTILLERY_TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Update GPS location
      - post:
          url: "/api/gps/update"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            driverId: 1
            vehicleId: 1
            latitude: 51.5074
            longitude: -0.1278
            speed: 60
            heading: 180
          expect:
            - statusCode: 200
  
  # Dashboard data retrieval
  - name: "Dashboard Data Retrieval"
    weight: 15
    flow:
      # Login as manager
      - post:
          url: "/api/auth/login"
          json:
            email: "manager@example.com"
            password: "{{ $processEnvironment.ARTILLERY_TEST_PASSWORD }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      # Get dashboard stats
      - get:
          url: "/api/dashboard/stats"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      # Get recent inspections
      - get:
          url: "/api/inspections?limit=20"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      # Get active defects
      - get:
          url: "/api/defects?status=OPEN&status=IN_PROGRESS"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      # Get reminders
      - get:
          url: "/api/reminders?status=ACTIVE"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200